cf_billing/Documents/бестОбращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестОбращения</Name>
			<BasedOn>
				<xr:Item>Document.бестОбращения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестЭтапыОбращений</xr:Item>
				<xr:Item>InformationRegister.бестЭтапыОбращенийЮрЛиц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестВидыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестЭтапыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаИсполнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОкончанияЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>traceId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>requestId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>eventName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоговораERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бестОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестОбращения/Forms/ФормаДокументаОбращениеФизическогоЛица/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеВидимостьюИДоступностью();
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры);
		
		Если Не ЗначениеЗаполнено(Параметры.Основание) Тогда
		 	Объект.ЭтапОбращения	= ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ПервичноеОбращение");
		КонецЕсли;
		Объект.Дата = ТекущаяДата();
		ЗаполнитьПлановуюДатуОкончанияЭтапа();
	КонецЕсли;
	
	// ОТЭК, 19.05.2020, 000353559, добавлены подключаемые команды.
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	Объект.Организация = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Район, "Организация");
	Объект.Абонент = ПредопределенноеЗначение("Справочник.энргАбоненты.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапОбращенияПриИзменении(Элемент)
	УправлениеВидимостьюИДоступностью()
КонецПроцедуры

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		// ОТЭК, 19.05.2020, 000353559.
		// энргПользовательскийВводКлиент.ПриИзмененииАбонента(Объект); 		 		 
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
		// ОТЭК, 19.05.2020, 000353559.
	иначе
		Объект.МКД 			= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.ЛицевойСчет 	="";
		Объект.АдресОбъекта	="";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьПлановуюДатуОкончанияЭтапа();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьПлановуюДатуОкончанияЭтапа()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ОТЭК, 19.05.2020, 000353559, добавлены подключаемые команды.
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УправлениеВидимостьюИДоступностью()
	ЭтоПервичноеОбращение							= ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ПервичноеОбращение");
	//Элементы.ТекстОбращения.ТолькоПросмотр			= НЕ (Объект.ЭтапОбращения = ЭтоПервичноеОбращение);
	//Элементы.ВидОбращения.ТолькоПросмотр			= НЕ (Объект.ЭтапОбращения = ЭтоПервичноеОбращение);
	Элементы.Основание.Доступность					= Объект.ЭтапОбращения <> ЭтоПервичноеОбращение;
	Элементы.Основание.Видимость					= Объект.ЭтапОбращения <> ЭтоПервичноеОбращение;
	Элементы.Ответ.Видимость						= Объект.ЭтапОбращения.ВидимостьОтвета;
	//Элементы.Ответ.ТолькоПросмотр					= Объект.ЭтапОбращения = ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_ОтветНаОбращение");
	Элементы.ОтветственныйЗаИсполнение.Видимость	= Объект.ЭтапОбращения = ПредопределенноеЗначение("Справочник.бестЭтапыОбращений.ЭтапОбращений_НазначенОтветственный");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановуюДатуОкончанияЭтапа()
	ПОбъект = РеквизитФормыВЗначение("Объект");
	ПОбъект.ЗаполнитьПлановуюДатуОкончанияЭтапа();
	ЗначениеВРеквизитФормы(ПОбъект,"Объект");
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	//Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	//Запрос.УстановитьПараметр("Этап", 			Объект.ЭтапОбращения);
	//ЗАпрос.Текст = "ВЫБРАТЬ
	//|	бестСрокиЭтаповОбращенийСрезПоследних.Срок КАК Срок
	//|ИЗ
	//|	РегистрСведений.бестСрокиЭтаповОбращений.СрезПоследних(
	//|			&Дата,
	//|			Организация = &Организация
	//|				И Этап = &Этап) КАК бестСрокиЭтаповОбращенийСрезПоследних
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бестСрокиЭтаповОбращенийСрезПоследних.Срок";
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Срок = 0;
	//Если Выборка.Следующий() Тогда
	//	Срок = Выборка.Срок;
	//КонецЕсли;
	//
	//Объект.ПлановаяДатаОкончанияЭтапа	= КонецДня(Объект.Дата + 86400*Срок);
КонецПроцедуры

&НаКлиенте
Процедура АбонентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// ОТЭК, 22.05.2020, 000202897.	
	энргПользовательскийВводКлиент.НачалоВыбораАбонента(Элемент, ОБъект.Организация, Объект.Район,,СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
